Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: online (via a web browser).
it_it: online (tramite un browser web).

source: only once just before each display refresh, and
it_it: solo una volta, subito prima di ogni aggiornamento dello schermo, e

source: only when it will change what the end user sees.
it_it: solo quando ciò cambierà ciò che l'utente finale vedrà.

source: optionally examines the existing "preference score" for the task mentioned above,
it_it: esamina facoltativamente il "punteggio di preferenza" esistente per il task sopra menzionato,

source: optionally store entire decoded image;
it_it: memorizza facoltativamente l'intera immagine decodificata;

source: or
it_it: o da

source: or any other display where you can control the color/state of the pixels
it_it: o qualsiasi altro display in cui sia possibile controllare il colore/stato dei pixel

source: or by selecting a configuration in the ``User_Setup_Select.h``
it_it: oppure selezionando una configurazione in ``User_Setup_Select.h``

source: or navigate to **File \> Open Folder** in VS Code and open ``alif_m55-lvgl``.
it_it: oppure si va su **File \> Open Folder** in VS Code e si apre ``alif_m55-lvgl``.

source: or the shorthand: :cpp:expr:`lv_tr("tag")`
it_it: o la sua abbreviazione: :cpp:expr:`lv_tr("tag")`

source: overview
it_it: panoramica

source: overview <=== relative path to .rst files located in the same directory
it_it: panoramica <=== path relativo ai file .rst situati nella stessa directory

source: parallelized flushing with DMA2D (only for partial render mode)
it_it: flushing parallelo con DMA2D (solo per la modalità di rendering parziale)

source: part of FFmpeg library
it_it: parte della libreria FFmpeg

source: partial opacity
it_it: opacità parziale

source: perform measurement
it_it: eseguire la misurazione

source: perform measurement,
it_it: eseguire la misurazione,

source: performs an initial notification to the Observer (allowing the Observer to update itself with the Subject's current value), and
it_it: esegue una notifica iniziale all'Observer (consentendo all'Observer di aggiornarsi con il valore corrente del Subject), e

source: place 3 blank lines above the 2nd and subsequent "Section" titles (see above),
it_it: inserire 3 righe vuote sopra il secondo e i successivi titoli di "Sezione" (vedere sopra),

source: placeholder
it_it: segnaposto

source: please notice in this case the `BUF_SIZE` needs to have, at least, space to hold data of 1/10 of the actual display dimensions.
it_it: Si noti che in questo caso `BUF_SIZE` deve avere almeno uno spazio sufficiente a contenere dati pari a 1/10 delle dimensioni effettive del display.

source: pointer Subject
it_it: Subject pointer

source: pointer to a byte array where the data of the image is stored (pixels and sometimes indexed color palettes [for indexed color formats]).
it_it: Puntatore a un array di byte in cui sono memorizzati i dati dell'immagine (pixel e talvolta tavolozze di colori indicizzati [per i formati di colore indicizzati]).

source: prefer ``typedef struct`` and ``typedef enum`` instead of ``struct name`` and ``enum name``
it_it: preferire ``typedef struct`` e ``typedef enum`` invece di ``struct name`` e ``enum name``

source: radius
it_it: raggio

source: reStructuredText Content
it_it: Contenuto reStructuredText

source: reStructuredText syntax for creating tables can be found in the reST examples referred to above.
it_it: La sintassi di reStructuredText per la creazione di tabelle è disponibile negli esempi reST citati sopra.

source: read input devices --- during the creation of each :ref:`indev`, a Timer is created for that Input Device based on the configured value of :c:macro:`LV_DEF_REFR_PERIOD`.
it_it: Dispositivi di input di lettura: durante la creazione di ogni :ref:`indev`, viene creato un Timer per quel Dispositivo di Input in base al valore configurato di :c:macro:`LV_DEF_REFR_PERIOD`.

source: read input devices,
it_it: leggere i dispositivi di input,

source: readability (the ease with which other programmers can read your comments),
it_it: leggibilità (la facilità con cui altri programmatori possono leggere i vostri commenti),

source: reference to the GitHub issue or Pull Request if applicable.
it_it: riferimento al problema di GitHub o alla Pull Request, se applicabile.

source: refresh a label when the language changes
it_it: aggiornare un'etichetta quando cambia la lingua

source: refresh display(s),
it_it: aggiornare i(l) display,

source: refresh each display --- during the creation of each :ref:`Display`, a Timer is created for that Display.
it_it: aggiornare ogni display: durante la creazione di ogni :ref:`Display`, viene creato un Timer per quel display.

source: releasing the MUTEX (unlocking it) afterwards.
it_it: il rilascio del MUTEX (unlocking) in seguito.

source: replaces ``tick_style_1`` with ``tick_style_2`` for part :cpp:enumerator:`LV_PART_INDICATOR` rather than adding to it.
it_it: sostituisce ``tick_style_1`` con ``tick_style_2`` per la parte :cpp:enumerator:`LV_PART_INDICATOR` anziché aggiungerla.

source: requires apps to handle display resolution changes properly.
it_it: richiede alle app di gestire correttamente le modifiche alla risoluzione del display.

source: reserved for future use
it_it: riservato per uso futuro

source: respectively.
it_it: rispettivamente.

source: return :cpp:enumerator:`LV_RESULT_OK` if decoder can decode the given image, :cpp:enumerator:`LV_RESULT_INVALID` otherwise.
it_it: restituisce :cpp:enumerator:`LV_RESULT_OK` se il decodificatore può decodificare l'immagine specificata, :cpp:enumerator:`LV_RESULT_INVALID` in caso contrario.

source: returns a pointer to the newly-created Observer.
it_it: restituisce un puntatore all'Observer appena creato.

source: returns the LVGL animation which controls the Lottie animation.
it_it: restituisce l'animazione LVGL che controlla quella Lottie.

source: rotation
it_it: rotazione

source: run any animations, and
it_it: eseguire eventuali animazioni ed

source: run user-created timers.
it_it: eseguire i timer creati dall'utente.

source: scale
it_it: scala

source: scroll and zoom
it_it: eseguire scroll e zoom

source: scroll widgets
it_it: "scrollare" i widget

source: see the components instantly in the preview,
it_it: visualizzare i componenti all'istante nell'anteprima,

source: semicolon
it_it: punto e virgola

source: send a wide variety of :ref:`Events <events>` (including click, long press, double click, and many more)
it_it: inviare un'ampia varietà di :ref:`Eventi <events>` (inclusi clic, pressione prolungata, doppio clic e molti altri)

source: send the buffer's content to each real display with the truncated area.
it_it: inviando il contenuto del buffer a ciascun display reale con l'area troncata.

source: set ``dsc->decoded`` to ``NULL`` to indicate the image can be decoded incrementally;
it_it: imposta ``dsc->decoded`` a ``NULL`` per indicare che l'immagine può essere decodificata in modo incrementale;

source: set margins,
it_it: impostare i margini,

source: set properties on :cpp:type:`lv_style_t` objects (e.g. :ref:`shared styles <style_initialize>`) (``lv_obj_report_style_change`` needs to be called to notify the widgets having the style)
it_it: impostano le proprietà sugli oggetti :cpp:type:`lv_style_t` (ad esempio, :ref:`stili condivisi <style_initialize>`) (``lv_obj_report_style_change`` deve essere chiamato per notificare i widget che hanno lo stile)

source: setting image source
it_it: impostazione della sorgente dell'immagine

source: setting the resolution of the displays to the large display's resolution;
it_it: impostando la risoluzione dei display alla risoluzione del display più grande;

source: several more Widget-ID-related API functions become available if :c:macro:`LV_USE_OBJ_ID_BUILTIN` is non-zero (more on this below);
it_it: diventano disponibili diverse altre funzioni API relative al Widget-ID se :c:macro:`LV_USE_OBJ_ID_BUILTIN` è diverso da zero (maggiori dettagli di seguito);

source: show or hide cursors
it_it: mostrare o nascondere i cursori

source: show or hide individual data points
it_it: mostrare o nascondere singoli punti dati

source: show or hide individual data series
it_it: mostrare o nascondere singole serie di dati

source: show precise locations of points or other locations on chart with cursors
it_it: mostrare posizioni precise di punti o altre posizioni sul grafico con i cursori

source: show the days of any month in a 7x7 matrix;
it_it: mostrare i giorni di qualsiasi mese in una matrice 7x7;

source: show the name of the days;
it_it: mostrare il nome dei giorni;

source: simplify (decreasing development time) writing bindings for LVGL in another language, such as:
it_it: semplificare (riducendo i tempi di sviluppo) la scrittura di binding per LVGL in un altro linguaggio, come:

source: single click to change editor focus to the matching XML element
it_it: fare un clic singolo per spostare il focus dell'editor sull'elemento XML corrispondente

source: single click to change editor focus to the matching XML element.
it_it: fare un clic singolo per spostare il focus dell'editor sull'elemento XML corrispondente.

source: single or double buffered
it_it: buffer singolo o doppio

source: skew
it_it: inclinazione

source: so the flow is:
it_it: quindi il flusso è:

source: some compilers don't support very long strings
it_it: alcuni compilatori non supportano stringhe molto lunghe

source: some compilers don't support very long strings.
it_it: alcuni compilatori non supportano stringhe molto lunghe.

source: some dark styles to check the required colors to dark
it_it: alcuni stili scuri per controllare i colori richiesti per scurire

source: some default style that are added normally with the ``<style>`` tag
it_it: alcuni stili predefiniti che vengono aggiunti normalmente con il tag ``<style>``

source: spread
it_it: estensione

source: stack: > 2kB (> 8 kB recommended)
it_it: stack: > 2kB (> 8 kB consigliati)

source: start on an ``Nx8`` coordinate, and
it_it: inizieranno con una coordinata ``Nx8``, e

source: start with *lv*
it_it: iniziano con *lv*

source: state (or OR-ed combination of states) from the ``LV_STATE_...`` enumeration values;
it_it: stato (o combinazione di stati con OR) dai valori dell'enumerazione ``LV_STATE_...``;

source: string Subject
it_it: Subject string

source: string or pointer Subject
it_it: Subject string o pointer

source: styles
it_it: stili

source: subjects
it_it: subject

source: subjects for data bindings
it_it: soggetti per i data binding.

source: support adjusting the subject to test :ref:`Data bindings <xml_subjects>`.
it_it: supportare l'adattamento del soggetto per testare i :ref:`Data binding <xml_subjects>`.

source: support writing and running :ref:`UI tests <xml_test>` in seconds,
it_it: supportare la scrittura e l'esecuzione di :ref:`test della UI <xml_test>` in pochi secondi,

source: supports dynamic window resizing with corresponding changes to LVGL display resolution,
it_it: supporta il ridimensionamento dinamico delle finestre con le relative modifiche alla risoluzione del display LVGL,

source: t's organized by the machine (or target board) for which the image was built.
it_it: È organizzato in base alla macchina (o board target) per cui è stata compilata l'immagine.

source: text and/or integer values for
it_it: valori di testo e/o interi per

source: the Label Widget's width is larger than the width of the longest line of text, and
it_it: la larghezza del Widget Label è maggiore della larghezza della riga di testo più lunga e

source: the XML editor parses the XML files of the LVGL widgets and the user's XML files to validate the XMLs
it_it: l'editor XML analizza i file XML dei widget LVGL e i file XML dell'utente per convalidare gli XML

source: the animation path (also known as the timing or easing function)
it_it: il path dell'animazione (noto anche come funzione di temporizzazione o "easing" [allentamento])

source: the basic button style defines dark-gray color for the default state and light-gray color for the pressed state
it_it: lo stile base del pulsante definisce il colore grigio scuro per lo stato di default e il colore grigio chiaro per lo stato pressed.

source: the color of pixels ranging from `low_color` to `high_color` will be transparent.
it_it: il colore dei pixel che vanno da `low_color` a `high_color` sarà trasparente.

source: the delay before starting the transition
it_it: il ritardo prima dell'inizio della transizione

source: the editor asks LVGL to create an instance of the opened XML file
it_it: l'editor chiede a LVGL di creare un'istanza del file XML aperto

source: the editor sends the XML files to LVGL
it_it: l'editor invia i file XML a LVGL

source: the font is stored as an array of bitmaps, one bitmap per glyph;
it_it: il font è memorizzato come un array di bitmap, una bitmap per glifo;

source: the height is set automatically to show only one line,
it_it: l'altezza viene impostata automaticamente per visualizzare una sola riga,

source: the image is transformed directly without creating an intermediate layer (buffer) to snapshot the Widget.
it_it: l'immagine viene trasformata direttamente senza creare un livello intermedio (buffer) per catturare l'immagine del Widget.

source: the inspector uses LVGL as it is
it_it: l'inspector utilizza LVGL così com'è

source: the object (variable) being animated is deleted (and it is not a Widget) or
it_it: l'oggetto (variabile) animato viene eliminato (e non è un Widget) oppure

source: the properties to animate
it_it: le proprietà da animare

source: the red button style defines the background color as red only in the default state
it_it: lo stile del pulsante rosso definisce il colore di sfondo come rosso solo nello stato di default.

source: the strings produced by :cpp:expr:`lv_obj_stringify_id(widget, buf, len)` would be
it_it: Le stringhe prodotte da :cpp:expr:`lv_obj_stringify_id(widget, buf, len)` sarebbero:

source: the text has multiple lines with different line lengths.
it_it: il testo ha più righe con lunghezze diverse.

source: the time of the transition
it_it: il tempo della transizione

source: the value stored for each pixel determines the pixel's opacity, enabling edges to be smoother --- higher bpp values result in smoother edges.
it_it: il valore memorizzato per ciascun pixel determina l'opacità del pixel, consentendo bordi più smussati: valori bpp più elevati producono bordi più smussati.

source: then mark the processing status in ``cache_entry->process_state`` (to avoid repeated post-processing).
it_it: contrassegna lo stato di elaborazione in ``cache_entry->process_state`` (per evitare post-elaborazioni ripetute).

source: these two API functions become available:
it_it: diventano disponibili queste due funzioni API:

source: they can be compressed better
it_it: possono essere compressi meglio

source: they need the most memory
it_it: richiedono più memoria

source: ticking the ``Compressed`` check box in the online converter
it_it: selezionando la check box ``Compressed`` nel convertitore online

source: timeline animations
it_it: timeline delle animazioni

source: to
it_it: in

source: to avoid escaping ``"`` character in the JSON file, and
it_it: per evitare l'escape del carattere ``"`` nel file JSON e

source: to describe how these items look.
it_it: per descrivere l'aspetto di questi elementi.

source: to get that one Style object to apply to both major and minor ticks.
it_it: per fare in modo che quell'oggetto Style venga applicato sia alle tacche maggiori che a quella minori.

source: to set the current language.
it_it: per impostare la lingua corrente.

source: to synchronize rendering with VSYNC or the TE signal;
it_it: per sincronizzare il rendering con VSYNC o il segnale TE [Tearing Effect];

source: to time display refreshes immediately after a single screen update of all widgets that needed to have their display data updated (i.e. only updated once immediately before display refresh to reduce CPU overhead).
it_it: per impostare il refresh del display immediatamente dopo un singolo aggiornamento dello schermo di tutti i widget da aggiornare (ovvero, aggiornarli solo una volta immediatamente prima del refresh del display per ridurre il sovraccarico della CPU).

source: to:
it_it: in:

source: toctree:: <=== Table of contents directive
it_it: toctree:: <=== Direttiva del sommario

source: today has a thicker border with the theme's primary color - highlighted days have some opacity with the theme's primary color.
it_it: "today" [oggi] ha un bordo più spesso con il colore primario del tema; i giorni evidenziati hanno una certa opacità con il colore primario del tema.

source: touch-pads,
it_it: touch-pad,

source: touch-screens,
it_it: touch-screen,

source: transformations
it_it: trasformazioni

source: trigger and handle :ref:`Gestures <indev_gestures>`
it_it: attivare e gestire :ref:`Gesture <indev_gestures>`

source: try out Online Share
it_it: provare Online Share

source: two additional configuration macros both :c:macro:`LV_OBJ_ID_AUTO_ASSIGN` and :c:macro:`LV_USE_OBJ_ID_BUILTIN` now have meaning.
it_it: ora sono disponibili due macro di configurazione aggiuntive, :c:macro:`LV_OBJ_ID_AUTO_ASSIGN` e :c:macro:`LV_USE_OBJ_ID_BUILTIN`.

source: update mode (modifies behavior of :cpp:func:`lv_chart_set_next_value` if you use it).
it_it: modalità di aggiornamento (modifica il comportamento di :cpp:func:`lv_chart_set_next_value` se utilizzato).

source: update system-monitor values --- if :c:macro:`LV_USE_SYSMON` is set to ``1`` in ``lv_conf.h``, one or more timers are created to periodically compute and monitor system performance statistics and LVGL's memory usage.
it_it: Aggiorna i valori del monitor di sistema: se :c:macro:`LV_USE_SYSMON` è impostato a ``1`` in ``lv_conf.h``, vengono creati uno o più timer per calcolare e monitorare periodicamente le statistiche sulle prestazioni del sistema e l'utilizzo della memoria di LVGL.

source: update that buffer with the new strings only when they will make a visible difference for the end user, and
it_it: aggiornare tale buffer con le nuove stringhe solo quando queste apporteranno una differenza visibile per l'utente finale e

source: update the Label with :cpp:expr:`lv_label_set_text_static(label, buffer)` using that buffer.
it_it: aggiornare l'etichetta con :cpp:expr:`lv_label_set_text_static(label, buffer)` utilizzando tale buffer.

source: updates LVGL display DPI when Windows DPI changes,
it_it: aggiorna i DPI del display LVGL quando cambiano i DPI di Windows,

source: use 1-bpp because we don't use anti-aliasing.
it_it: Si usa 1 bpp perché non usiamo l'anti-aliasing.

source: use an inspector tool to visualize widget sizes, paddings, etc.,
it_it: utilizzare uno strumento di ispezione per visualizzare le dimensioni dei widget, i padding, ecc.,

source: use the Editor for education
it_it: utilizzare l'Editor per scopi didattici

source: use the Editor for open-source projects
it_it: utilizzare l'Editor per progetti open source

source: use the imperative mood: e.g. present tense "change", not "changed" nor "changes";
it_it: usare il modo imperativo: ad esempio, il presente "change", non "changed" né "changes";

source: user scrolls and releases a Widget;
it_it: L'utente scorre e rilascia un Widget;

source: uses Windows DPI scaling to stretch content,
it_it: utilizza il ridimensionamento DPI di Windows per estendere i contenuti,

source: uses window size (not client area) when setting resolution via :cpp:func:`lv_windows_create_display`, and
it_it: utilizza le dimensioni della finestra (non l'area client) quando si imposta la risoluzione tramite :cpp:func:`lv_windows_create_display`, e

source: using the :ref:`offline converter <images_offline_converter>`
it_it: utilizzando il :ref:`convertitore offline <images_offline_converter>`

source: using the :ref:`online converter <images_online_converter>`
it_it: utilizzando il :ref:`convertitore online <images_online_converter>`

source: value == 0
it_it: valore == 0

source: value describing the speed of the specified Draw Unit relative to software rendering (more on this below)
it_it: valore che descrive la velocità della Draw Unit specificata rispetto al rendering software (maggiori dettagli di seguito)

source: visualise bounding box, padding, margins and click area
it_it: visualizzare il "bounding box", il padding, i margini e l'area di clic

source: visualise bounding box, padding, margins and click area,
it_it: visualizzare il "bounding box", la spaziatura interna, i margini e l'area di clic,

source: visualize sensor data directly and easily on the board without using a computer.
it_it: Visualizzazione dei dati dei sensori direttamente e facilmente sulla scheda senza utilizzare un computer.

source: waiting, queued, in progress, completed
it_it: in attesa, in coda, in corso, completato

source: when the File Explorer is initially opened,
it_it: all'apertura iniziale di File Explorer,

source: when the xml changes only the opened XML file is uploaded, the screen is cleared, and a new instance is created
it_it: quando l'XML cambia, viene caricato solo il file XML aperto, lo schermo viene cancellato e viene creata una nuova istanza

source: where ``component_name`` is replaced by the Component's XML file name.
it_it: dove ``component_name`` viene sostituito dal nome del file XML del Componente.

source: where ``min`` and ``max`` will become the numeric low and high values for the Scale, and ``angle_range`` is the angle between the low and high ends of the Scale.
it_it: dove ``min`` e ``max`` diventeranno i valori numerici minimo e massimo della Scale, e ``angle_range`` è l'angolo tra i limiti minimo e massimo della Scale.

source: where ``my_image`` is an :cpp:type:`lv_image_dsc_t`.
it_it: dove ``my_image`` è un :cpp:type:`lv_image_dsc_t`.

source: where the Observer's notification callback should look like this:
it_it: dove la callback di notifica dell'Observer dovrebbe apparire così:

source: where to render pixels for it (:ref:`draw_buffers`), and
it_it: dove renderizzare i pixel (:ref:`draw_buffers`), e

source: where:
it_it: dove:

source: whereas **Application Mode**:
it_it: mentre **Application Mode**:

source: which only include the most commonly used modules and options, which is important to save limited FLASH space.
it_it: che includono solo i moduli e le opzioni più comunemente utilizzati, il che è importante per risparmiare spazio FLASH limitato.

source: which, itself includes ``lv_conf.h``.
it_it: che, a sua volta, include ``lv_conf.h``.

source: width |times| height |times| 4
it_it: larghezza |times| altezza |times| 4

source: will install all the prerequisite packages.
it_it: installerà tutti i pacchetti prerequisiti.

source: will produce all the bytes from the ``input.gif`` in unaltered form in a C array, ready to use in this code:
it_it: produrrà tutti i byte di ``input.gif`` in forma inalterata in un array C, pronti per essere utilizzati in questo codice:

source: with Micro-HDMI bridge
it_it: con Micro-HDMI

source: with an optional transition
it_it: con una transizione opzionale

source: word wrap is disabled.
it_it: il ritorno a capo automatico è disabilitato.

source: you can set the macro :c:macro:`LV_USE_DRAW_ARM2D_SYNC` to ``1`` and :c:macro:`LV_DRAW_SW_ASM` to ``LV_DRAW_SW_ASM_HELIUM`` in ``lv_conf.h`` to enable Arm-2D synchronous acceleration for LVGL.
it_it: è possibile impostare la macro :c:macro:`LV_USE_DRAW_ARM2D_SYNC` a ``1`` e :c:macro:`LV_DRAW_SW_ASM` a ``LV_DRAW_SW_ASM_HELIUM`` in ``lv_conf.h`` per abilitare l'accelerazione sincrona Arm-2D per LVGL.

source: you cannot delete a Widget because something else is still using it,
it_it: non si può eliminare un Widget perché qualcos'altro lo sta ancora utilizzando,
